sample/hashi/1bench-multiparam/nomad-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-t4-c512-d30-R4000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://10.10.1.4:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 0.651ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.653ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.655ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.637ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   637.64us  573.39us   2.10ms   89.76%
    Req/Sec     1.06k   334.32     1.90k    65.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  446.00us
 75.000%  661.00us
 90.000%    1.49ms
 99.000%    2.10ms
 99.900%    2.91ms
 99.990%   15.69ms
 99.999%   16.01ms
100.000%   16.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.239     0.000000            1         1.00
       0.355     0.100000         8158         1.11
       0.376     0.200000        16134         1.25
       0.394     0.300000        24092         1.43
       0.414     0.400000        32064         1.67
       0.446     0.500000        40073         2.00
       0.479     0.550000        43943         2.22
       0.568     0.600000        47916         2.50
       0.609     0.650000        52042         2.86
       0.635     0.700000        55889         3.33
       0.661     0.750000        59893         4.00
       0.676     0.775000        61983         4.44
       0.692     0.800000        63869         5.00
       0.714     0.825000        65915         5.71
       0.746     0.850000        67895         6.67
       0.806     0.875000        69862         8.00
       0.873     0.887500        70857         8.89
       1.488     0.900000        71844        10.00
       1.597     0.912500        72844        11.43
       1.666     0.925000        73841        13.33
       1.728     0.937500        74839        16.00
       1.760     0.943750        75340        17.78
       1.790     0.950000        75842        20.00
       1.821     0.956250        76339        22.86
       1.855     0.962500        76842        26.67
       1.890     0.968750        77333        32.00
       1.912     0.971875        77586        35.56
       1.932     0.975000        77831        40.00
       1.959     0.978125        78095        45.71
       1.987     0.981250        78334        53.33
       2.019     0.984375        78582        64.00
       2.039     0.985938        78705        71.11
       2.059     0.987500        78837        80.00
       2.081     0.989062        78960        91.43
       2.107     0.990625        79083       106.67
       2.139     0.992188        79203       128.00
       2.161     0.992969        79267       142.22
       2.185     0.993750        79330       160.00
       2.209     0.994531        79393       182.86
       2.235     0.995313        79454       213.33
       2.273     0.996094        79515       256.00
       2.301     0.996484        79551       284.44
       2.319     0.996875        79578       320.00
       2.347     0.997266        79613       365.71
       2.363     0.997656        79639       426.67
       2.421     0.998047        79671       512.00
       2.451     0.998242        79686       568.89
       2.495     0.998437        79703       640.00
       2.549     0.998633        79717       731.43
       2.731     0.998828        79733       853.33
       2.933     0.999023        79749      1024.00
       3.213     0.999121        79756      1137.78
       4.439     0.999219        79764      1280.00
       8.959     0.999316        79772      1462.86
      15.215     0.999414        79780      1706.67
      15.367     0.999512        79788      2048.00
      15.415     0.999561        79791      2275.56
      15.439     0.999609        79795      2560.00
      15.463     0.999658        79800      2925.71
      15.487     0.999707        79803      3413.33
      15.567     0.999756        79808      4096.00
      15.583     0.999780        79809      4551.11
      15.607     0.999805        79811      5120.00
      15.623     0.999829        79813      5851.43
      15.655     0.999854        79816      6826.67
      15.679     0.999878        79817      8192.00
      15.695     0.999890        79818      9102.22
      15.711     0.999902        79819     10240.00
      15.719     0.999915        79820     11702.86
      15.767     0.999927        79822     13653.33
      15.767     0.999939        79822     16384.00
      15.767     0.999945        79822     18204.44
      15.975     0.999951        79823     20480.00
      15.975     0.999957        79823     23405.71
      16.015     0.999963        79825     27306.67
      16.015     0.999969        79825     32768.00
      16.015     0.999973        79825     36408.89
      16.015     0.999976        79825     40960.00
      16.015     0.999979        79825     46811.43
      16.015     0.999982        79825     54613.33
      16.015     0.999985        79825     65536.00
      16.015     0.999986        79825     72817.78
      16.111     0.999988        79826     81920.00
      16.111     1.000000        79826          inf
#[Mean    =        0.638, StdDeviation   =        0.573]
#[Max     =       16.104, Total count    =        79826]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  118954 requests in 30.00s, 22.76MB read
Requests/sec:   3964.77
Transfer/sec:    776.70KB